src/cf/DataProcessors/ОбновлениеЗадачПриПереходеНаНовуюВерсию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеЗадачПриПереходеНаНовуюВерсию</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Documents/ДействиеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДействиеЗадачи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЗадачПоИсполнителям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчастника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОсобыйСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВИсточнике</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникДействийЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоОтметил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПричинаВозврата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеОписаниеФорматированное</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеПричиныВозврата</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйАвтор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействияТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеУчастникаЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПриложениеОтчетовОбИсполнении</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/ОбновлениеЗадачПриПереходеНаНовуюВерсию/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВсегоДействийЗадач = ВсегоДействийЗадач();
	ВсегоЗадач = ВсегоЗадач();
	
	ОбновитьТекущееСостояние();
	
	Элементы.ЗапускПотоковОбновления.Видимость = Не ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	ПотоковДляЗапуска = 10;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьТекущееСостояниеОжидание", 3, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПотоковДляЗапускаПриИзменении(Элемент)
	
	НачалоПрогноза = Дата(1, 1, 1);
	КоличествоОбъектовПрогноза = 0;
	ОбновитьТекущееСостояние();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПрогноз(Команда)
	
	НачалоПрогноза = Дата(1, 1, 1);
	КоличествоОбъектовПрогноза = 0;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьТекущееСостояниеОжидание()
	
	ОбновитьТекущееСостояние();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущееСостояние()
	
	ДействийЗадачКОбновлению = ДействийЗадачКОбновлению();
	ЗадачКОбновлению = ЗадачКОбновлению();
	
	ОбновитьФоновыеЗадания();
	
	ЗапуститьОбновление();
	
	РассчитатьПрогноз();
	СостояниеОбновленоВ = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаСервере
Функция ДействийЗадачКОбновлению()
	
	КоличествоОбъектов = 0;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДействиеЗадачи.Ссылка) КАК КоличествоОбъектов
		|ИЗ
		|	Документ.ДействиеЗадачи КАК ДействиеЗадачи
		|ГДЕ
		|	ДействиеЗадачи.ВерсияОбновления = 0");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоОбъектов = Выборка.КоличествоОбъектов;
	КонецЕсли;
	
	Возврат КоличествоОбъектов;
	
КонецФункции

&НаСервере
Функция ВсегоДействийЗадач()
	
	КоличествоОбъектов = 0;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДействиеЗадачи.Ссылка) КАК КоличествоОбъектов
		|ИЗ
		|	Документ.ДействиеЗадачи КАК ДействиеЗадачи");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоОбъектов = Выборка.КоличествоОбъектов;
	КонецЕсли;
	
	Возврат КоличествоОбъектов;
	
КонецФункции

&НаСервере
Функция ЗадачКОбновлению()
	
	КоличествоОбъектов = 0;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Задача.Ссылка) КАК КоличествоОбъектов
		|ИЗ
		|	Документ.Задача КАК Задача
		|ГДЕ
		|	Задача.ВерсияОбновления = 0");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоОбъектов = Выборка.КоличествоОбъектов;
	КонецЕсли;
	
	Возврат КоличествоОбъектов;
	
КонецФункции

&НаСервере
Функция ВсегоЗадач()
	
	КоличествоОбъектов = 0;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Задача.Ссылка) КАК КоличествоОбъектов
		|ИЗ
		|	Документ.Задача КАК Задача");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоОбъектов = Выборка.КоличествоОбъектов;
	КонецЕсли;
	
	Возврат КоличествоОбъектов;
	
КонецФункции

&НаСервере
Процедура ЗапуститьОбновление()
	
	Если ПотоковДляЗапуска = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееКоличествоЗаданий = АктивныеЗаданияОбновления.Количество();
	
	Если Не ЗначениеЗаполнено(НачалоПрогноза) Тогда
		НачалоПрогноза = ТекущаяДатаСеанса();
		КоличествоОбъектовПрогноза = ДействийЗадачКОбновлению + ЗадачКОбновлению;
	КонецЕсли;
	
	Пока ТекущееКоличествоЗаданий < ПотоковДляЗапуска Цикл
		
		ЕстьДанныеКОбновлению = Ложь;
		
		// Обновим действия задач.
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 100
			|	ДействиеЗадачи.Ссылка КАК Ссылка,
			|	ДействиеЗадачи.Дата КАК Дата
			|ИЗ
			|	Документ.ДействиеЗадачи КАК ДействиеЗадачи
			|ГДЕ
			|	ДействиеЗадачи.ВерсияОбновления = 0
			|	И ДействиеЗадачи.Дата < &ГраницаОбновленияДействийЗадач
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДействиеЗадачи.Дата УБЫВ");
		
		Если Не ЗначениеЗаполнено(ГраницаОбновленияДействийЗадач) Тогда
			ГраницаОбновленияДействийЗадач = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Запрос.Параметры.Вставить("ГраницаОбновленияДействийЗадач", ГраницаОбновленияДействийЗадач);
		
		МассивОбновления = Новый Массив;
		
		//@skip-check query-in-loop
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МассивОбновления.Добавить(Выборка.Ссылка);
			ГраницаОбновленияДействийЗадач = Выборка.Дата;
			
		КонецЦикла;
		
		Если МассивОбновления.Количество() > 0 Тогда
			
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(МассивОбновления);
			
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(
				"ОбновлениеИнформационнойБазыДокументооборот.ОбновитьДействияЗадачДоВерсииОбновления1",
				ПараметрыФоновогоЗадания);
			
			АктивныеЗаданияОбновления.Добавить(ФоновоеЗадание.УникальныйИдентификатор);
			
			ТекущееКоличествоЗаданий = ТекущееКоличествоЗаданий + 1;
			ЕстьДанныеКОбновлению = Истина;
			
		Иначе
			
			ГраницаОбновленияДействийЗадач = Дата(1, 1, 1);
			
		КонецЕсли;
		
		// Обновим задачи.
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 100
			|	Задача.Ссылка КАК Ссылка,
			|	Задача.Дата КАК Дата
			|ИЗ
			|	Документ.Задача КАК Задача
			|ГДЕ
			|	Задача.ВерсияОбновления = 0
			|	И Задача.Дата < &ГраницаОбновленияЗадач
			|
			|УПОРЯДОЧИТЬ ПО
			|	Задача.Дата УБЫВ");
		
		Если Не ЗначениеЗаполнено(ГраницаОбновленияЗадач) Тогда
			ГраницаОбновленияЗадач = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Запрос.Параметры.Вставить("ГраницаОбновленияЗадач", ГраницаОбновленияЗадач);
		
		МассивОбновления = Новый Массив;
		
		//@skip-check query-in-loop
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МассивОбновления.Добавить(Выборка.Ссылка);
			ГраницаОбновленияЗадач = Выборка.Дата;
			
		КонецЦикла;
		
		Если МассивОбновления.Количество() > 0 Тогда
			
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(МассивОбновления);
			
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(
				"ОбновлениеИнформационнойБазыДокументооборот.ОбновитьЗадачиДоВерсииОбновления1",
				ПараметрыФоновогоЗадания);
			
			АктивныеЗаданияОбновления.Добавить(ФоновоеЗадание.УникальныйИдентификатор);
			
			ТекущееКоличествоЗаданий = ТекущееКоличествоЗаданий + 1;
			ЕстьДанныеКОбновлению = Истина;
			
		Иначе
			
			ГраницаОбновленияЗадач = Дата(1, 1, 1);
			
		КонецЕсли;
		
		Если Не ЕстьДанныеКОбновлению Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФоновыеЗадания()
	
	КоличествоЭлементов = АктивныеЗаданияОбновления.Количество();
	Для Индекс = 1 По КоличествоЭлементов Цикл
		
		ОбратныйИндекс = КоличествоЭлементов - Индекс;
		АктивноеЗаданиеУИД = АктивныеЗаданияОбновления[ОбратныйИндекс].Значение;
		
		АктивноеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(АктивноеЗаданиеУИД);
		Если АктивноеЗадание <> Неопределено
			И АктивноеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Продолжить;
		КонецЕсли;
		
		АктивныеЗаданияОбновления.Удалить(ОбратныйИндекс);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПрогноз()
	
	СкоростьОбновления = 0;
	ОсталосьЧасов = 0;
	ОсталосьМинут = 0;
	ОсталосьСекунд = 0;
	
	КоличествоОбъектов = ДействийЗадачКОбновлению + ЗадачКОбновлению;
	
	Если КоличествоОбъектовПрогноза = КоличествоОбъектов Тогда
		Возврат;
	КонецЕсли;
	
	ВремяПрогноза = ТекущаяДатаСеанса() - НачалоПрогноза;
	КоличествоПрогноза = КоличествоОбъектовПрогноза - КоличествоОбъектов;
	Если ВремяПрогноза = 0 Или КоличествоПрогноза = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СкоростьОбновления = КоличествоПрогноза / ВремяПрогноза;
	
	Если СкоростьОбновления <> 0 Тогда
		
		ОсталосьПрогнозСекунд = КоличествоОбъектов / СкоростьОбновления;
		
		ОсталосьЧасов = Цел(ОсталосьПрогнозСекунд / 3600);
		ОсталосьПрогнозСекунд = ОсталосьПрогнозСекунд - ОсталосьЧасов * 3600;
		
		ОсталосьМинут = Цел(ОсталосьПрогнозСекунд / 60);
		ОсталосьПрогнозСекунд = ОсталосьПрогнозСекунд - ОсталосьМинут * 60;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
